//100匹马，100担货，大马一匹驮3担，大马一匹驮2担，大马一匹驮0.5担，求大 中 小马的个数
/**
 *  设大中小马分别为x,y,z;
 *  x+y+z=100;
 *  3x+2y+0.5z=100;
 *  联立消去z,得5x+3y=100;只要求出满足此式的x,y,就可求出z;
 *  通过循环来解决，用拼凑的方法，x最大为20，y最大取33；
 *  x,y分别从0到20，和0到33，循环遍历，碰到满足情况的x,y，就可求小马个数
 *
 */
//#include<stdio.h>
//int main()
//{
//    int x,          //大马个数
//		y,          //大马个数
//		z,          //大马个数
//		m=0,
//		n=0;         //记录三种马的个数可能有几种组合情况；
//	for(x=0;x<=20;x++){//大马
//		for(y=0;y<=33;y++){//中马
//			m=5*x+3*y;
//			if(m==100){
//			   n=n+1;          //记录三种马的个数可能有几种组合情况；
//			   z=100-x-y;      //计算小马的个数
//			   printf("第 %d 种情况：大马：%-3d,中马：%-3d,小马：%-3d\n",n,x,y,z);
//			}
//		}
//	}
//	return 0;
//}

#include <stdio.h>
int main(){
	int x,y,z,m=0,n=0,p=0;
	for(x=0;x<=33;x++){
		for(y=0;y<=50;y++){
			for(z=0;z<=100;z++){   //虽然1匹小马驮0.5担货，需要200小匹马驮100货，但题目要求总共只有100匹马，所以小马最多为100
			   m=x+y+z;
			   n=3*x+2*y+(0.5)*z;
			   if(m == 100 && n== 100){
				   p=p+1;    
				   printf("第 %d 种情况：大马：%-5d,中马：%-5d,小马：%-5d\n",p,x,y,z);
			   }
			}
		}
	}
	return 0;
}

